Revit 2027 API
ExternalServices.BuiltInExternalServices.ModifyConnectionRangesService Property
 The external service to view and modify structural connection ranges of applicability.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalServiceId ModifyConnectionRangesService { get; }
Public Shared ReadOnly Property ModifyConnectionRangesService As ExternalServiceId
	Get
public:
static property ExternalServiceId^ ModifyConnectionRangesService {
	ExternalServiceId^ get ();
}
static member ModifyConnectionRangesService : ExternalServiceId with get
Property Value
ExternalServiceId
See Also
Reference
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace